In [9]:
import pandas as pd
import numpy as np

In [10]:
dict1 = {
    "name":['yogesh','shubham','Golu','skillf'],
    "marks":[92,34,24,17],
    "city":['Rampur',"Kolkata","Bareli","Antarctica"]
}

In [11]:
df = pd.DataFrame(dict1)

In [12]:
df

      name  marks        city
0   yogesh     92      Rampur
1  shubham     34     Kolkata
2     Golu     24      Bareli
3   skillf     17  Antarctica

In [13]:
df.to_csv('friends.csv')

In [18]:
df.to_csv('friends_index_false.csv', index = False)

In [20]:
df.head(2)

      name  marks     city
0   yogesh     92   Rampur
1  shubham     34  Kolkata

In [21]:
df.tail(2)

     name  marks        city
2    Golu     24      Bareli
3  skillf     17  Antarctica

In [22]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000